Ran Plan for 2 projects:

1. project: `network` dir: `network` workspace: `default`
1. project: `cluster` dir: `cluster` workspace: `default`
---

### 1. project: `network` dir: `network` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_eip.nat_a will be created
+ resource "aws_eip" "nat_a" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "aws_az_a_eip"
        }
      + tags_all             = {
          + "Name" = "aws_az_a_eip"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat_b will be created
+ resource "aws_eip" "nat_b" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "aws_az_b_eip"
        }
      + tags_all             = {
          + "Name" = "aws_az_b_eip"
        }
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.igw will be created
+ resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "Testing_igw"
        }
      + tags_all = {
          + "Name" = "Testing_igw"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.ngw_a will be created
+ resource "aws_nat_gateway" "ngw_a" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "az_a_nat"
        }
      + tags_all                           = {
          + "Name" = "az_a_nat"
        }
    }

  # aws_nat_gateway.ngw_b will be created
+ resource "aws_nat_gateway" "ngw_b" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "az_b_nat"
        }
      + tags_all                           = {
          + "Name" = "az_b_nat"
        }
    }

  # aws_route.private_a_natgw_a_rt will be created
+ resource "aws_route" "private_a_natgw_a_rt" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.private_a_natgw_b_rt will be created
+ resource "aws_route" "private_a_natgw_b_rt" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.public_igw_rt will be created
+ resource "aws_route" "public_igw_rt" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private_a_rt will be created
+ resource "aws_route_table" "private_a_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "private_az_a_route_table"
        }
      + tags_all         = {
          + "Name" = "private_az_a_route_table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private_b_rt will be created
+ resource "aws_route_table" "private_b_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "private_az_b_route_table"
        }
      + tags_all         = {
          + "Name" = "private_az_b_route_table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_rt will be created
+ resource "aws_route_table" "public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "public_rt"
        }
      + tags_all         = {
          + "Name" = "public_rt"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.app_a will be created
+ resource "aws_route_table_association" "app_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.app_b will be created
+ resource "aws_route_table_association" "app_b" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.utility_a will be created
+ resource "aws_route_table_association" "utility_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.app_a will be created
+ resource "aws_subnet" "app_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.30.226.128/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "az1_private_subnet"
          + "kubernetes.io/role/internal-elb" = null
        }
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.app_b will be created
+ resource "aws_subnet" "app_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.30.227.128/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "az1_private_subnet"
          + "kubernetes.io/role/internal-elb" = null
        }
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.utility_a will be created
+ resource "aws_subnet" "utility_a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.30.224.128/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "aza_public_subnet"
          + "kubernetes.io/role/elb" = null
        }
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.utility_b will be created
+ resource "aws_subnet" "utility_b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-south-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.30.225.128/25"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                   = "aza_public_subnet"
          + "kubernetes.io/role/elb" = null
        }
      + tags_all                                       = (known after apply)
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.vpc will be created
+ resource "aws_vpc" "vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.30.224.0/20"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Creator" = "tanmay"
          + "Name"    = "Testing_VPC"
          + "Purpose" = "Demo"
        }
      + tags_all                             = {
          + "Creator" = "tanmay"
          + "Name"    = "Testing_VPC"
          + "Purpose" = "Demo"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ private_subnets = [
      + (known after apply),
      + (known after apply),
    ]
+ vpc_id          = (known after apply)
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 19 to add, 0 to change, 0 to destroy.

---
### 2. project: `cluster` dir: `cluster` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -out \"/atlantis-data/repos/tanmay6414/openinnovationai/1/default/cluster/cluster-default.tfplan\"" in "/atlantis-data/repos/tanmay6414/openinnovationai/1/default/cluster": exit status 1
data.terraform_remote_state.network: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
data.aws_eks_addon_version.vpc_cni: Reading...
module.eks.data.aws_caller_identity.current: Reading...
data.aws_eks_addon_version.coredns: Reading...
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.data.aws_default_tags.current: Reading...
data.aws_eks_addon_version.kube_proxy: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_default_tags.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=768688893088]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 1s [id=768688893088]
data.aws_eks_addon_version.vpc_cni: Read complete after 1s [id=vpc-cni]
data.aws_eks_addon_version.coredns: Read complete after 1s [id=coredns]
data.aws_eks_addon_version.kube_proxy: Read complete after 1s [id=kube-proxy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "TestCluster"
      + path                  = "/"
      + tags                  = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + tags_all              = {
          + "Creator" = "tanmay"
          + "Name"    = "TestCluster"
          + "Purpose" = "Demo"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Error: Unable to find remote state
│ 
│   with data.terraform_remote_state.network,
│   on variable.tf line 44, in data "terraform_remote_state" "network":
│   44: data "terraform_remote_state" "network" {
│ 
│ No stored state was found for the given workspace in the given backend.
╵


```
</details>

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed